; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l22_p22_c22_g22_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(at crate20 depot)
	(at crate21 depot)
	(at crate22 depot)
	(crate-content crate1 food)
	(crate-content crate2 medicine)
	(crate-content crate3 medicine)
	(crate-content crate4 medicine)
	(crate-content crate5 medicine)
	(crate-content crate6 medicine)
	(crate-content crate7 medicine)
	(crate-content crate8 medicine)
	(crate-content crate9 medicine)
	(crate-content crate10 medicine)
	(crate-content crate11 medicine)
	(crate-content crate12 medicine)
	(crate-content crate13 medicine)
	(crate-content crate14 medicine)
	(crate-content crate15 medicine)
	(crate-content crate16 medicine)
	(crate-content crate17 medicine)
	(crate-content crate18 medicine)
	(crate-content crate19 medicine)
	(crate-content crate20 medicine)
	(crate-content crate21 medicine)
	(crate-content crate22 medicine)
	(at person1 loc2)
	(at person2 loc21)
	(at person3 loc2)
	(at person4 loc19)
	(at person5 loc14)
	(at person6 loc15)
	(at person7 loc16)
	(at person8 loc11)
	(at person9 loc21)
	(at person10 loc4)
	(at person11 loc11)
	(at person12 loc21)
	(at person13 loc6)
	(at person14 loc9)
	(at person15 loc22)
	(at person16 loc17)
	(at person17 loc8)
	(at person18 loc8)
	(at person19 loc6)
	(at person20 loc9)
	(at person21 loc3)
	(at person22 loc5)
	(person-needs person1 medicine)
	(person-needs person2 medicine)
	(person-needs person3 medicine)
	(person-needs person4 medicine)
	(person-needs person5 medicine)
	(person-needs person6 medicine)
	(person-needs person7 medicine)
	(person-needs person8 medicine)
	(person-needs person9 medicine)
	(person-needs person10 medicine)
	(person-needs person11 medicine)
	(person-needs person12 medicine)
	(person-needs person13 medicine)
	(person-needs person15 medicine)
	(person-needs person16 medicine)
	(person-needs person17 medicine)
	(person-needs person18 medicine)
	(person-needs person19 food)
	(person-needs person19 medicine)
	(person-needs person20 medicine)
	(person-needs person21 medicine)
	(person-needs person22 medicine)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 medicine)
	(person-has person2 medicine)
	(person-has person3 medicine)
	(person-has person4 medicine)
	(person-has person5 medicine)
	(person-has person6 medicine)
	(person-has person7 medicine)
	(person-has person8 medicine)
	(person-has person9 medicine)
	(person-has person10 medicine)
	(person-has person11 medicine)
	(person-has person12 medicine)
	(person-has person13 medicine)
	(person-has person15 medicine)
	(person-has person16 medicine)
	(person-has person17 medicine)
	(person-has person18 medicine)
	(person-has person19 food)
	(person-has person19 medicine)
	(person-has person20 medicine)
	(person-has person21 medicine)
	(person-has person22 medicine)
	))
)

; plan
1. (grab-arm1 drone1 crate1 depot)
   deleted: (arm1-free drone1) (at crate1 depot)
   added: (arm1-load drone1 crate1)
   goals met: 1 of 23
2. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 0 of 23
3. (deliver-arm1 drone1 person19 crate1 food loc6)
   deleted: (arm1-load drone1 crate1) (person-needs person19 food)
   added: (arm1-free drone1) (person-has person19 food)
   goals met: 1 of 23
4. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 2 of 23
5. (grab-arm1 drone1 crate7 depot)
   deleted: (arm1-free drone1) (at crate7 depot)
   added: (arm1-load drone1 crate7)
   goals met: 2 of 23
6. (grab-arm2 drone1 crate15 depot)
   deleted: (arm2-free drone1) (at crate15 depot)
   added: (arm2-load drone1 crate15)
   goals met: 2 of 23
7. (move-drone drone1 depot loc21)
   deleted: (at drone1 depot)
   added: (at drone1 loc21)
   goals met: 1 of 23
8. (deliver-arm1 drone1 person2 crate7 medicine loc21)
   deleted: (arm1-load drone1 crate7) (person-needs person2 medicine)
   added: (arm1-free drone1) (person-has person2 medicine)
   goals met: 2 of 23
9. (move-drone drone1 loc21 loc2)
   deleted: (at drone1 loc21)
   added: (at drone1 loc2)
   goals met: 2 of 23
10. (deliver-arm2 drone1 person3 crate15 medicine loc2)
   deleted: (arm2-load drone1 crate15) (person-needs person3 medicine)
   added: (arm2-free drone1) (person-has person3 medicine)
   goals met: 3 of 23
11. (move-drone drone1 loc2 depot)
   deleted: (at drone1 loc2)
   added: (at drone1 depot)
   goals met: 4 of 23
12. (grab-arm1 drone1 crate13 depot)
   deleted: (arm1-free drone1) (at crate13 depot)
   added: (arm1-load drone1 crate13)
   goals met: 4 of 23
13. (grab-arm2 drone1 crate17 depot)
   deleted: (arm2-free drone1) (at crate17 depot)
   added: (arm2-load drone1 crate17)
   goals met: 4 of 23
14. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 3 of 23
15. (deliver-arm1 drone1 person4 crate13 medicine loc19)
   deleted: (arm1-load drone1 crate13) (person-needs person4 medicine)
   added: (arm1-free drone1) (person-has person4 medicine)
   goals met: 4 of 23
16. (move-drone drone1 loc19 loc10)
   deleted: (at drone1 loc19)
   added: (at drone1 loc10)
   goals met: 4 of 23
17. (move-drone drone1 loc10 loc14)
   deleted: (at drone1 loc10)
   added: (at drone1 loc14)
   goals met: 4 of 23
18. (deliver-arm2 drone1 person5 crate17 medicine loc14)
   deleted: (arm2-load drone1 crate17) (person-needs person5 medicine)
   added: (arm2-free drone1) (person-has person5 medicine)
   goals met: 5 of 23
19. (move-drone drone1 loc14 depot)
   deleted: (at drone1 loc14)
   added: (at drone1 depot)
   goals met: 6 of 23
20. (grab-arm1 drone1 crate6 depot)
   deleted: (arm1-free drone1) (at crate6 depot)
   added: (arm1-load drone1 crate6)
   goals met: 6 of 23
21. (grab-arm2 drone1 crate14 depot)
   deleted: (arm2-free drone1) (at crate14 depot)
   added: (arm2-load drone1 crate14)
   goals met: 6 of 23
22. (move-drone drone1 depot loc15)
   deleted: (at drone1 depot)
   added: (at drone1 loc15)
   goals met: 5 of 23
23. (deliver-arm1 drone1 person6 crate6 medicine loc15)
   deleted: (arm1-load drone1 crate6) (person-needs person6 medicine)
   added: (arm1-free drone1) (person-has person6 medicine)
   goals met: 6 of 23
24. (move-drone drone1 loc15 loc16)
   deleted: (at drone1 loc15)
   added: (at drone1 loc16)
   goals met: 6 of 23
25. (deliver-arm2 drone1 person7 crate14 medicine loc16)
   deleted: (arm2-load drone1 crate14) (person-needs person7 medicine)
   added: (arm2-free drone1) (person-has person7 medicine)
   goals met: 7 of 23
26. (move-drone drone1 loc16 depot)
   deleted: (at drone1 loc16)
   added: (at drone1 depot)
   goals met: 8 of 23
27. (grab-arm1 drone1 crate8 depot)
   deleted: (arm1-free drone1) (at crate8 depot)
   added: (arm1-load drone1 crate8)
   goals met: 8 of 23
28. (move-drone drone1 depot loc11)
   deleted: (at drone1 depot)
   added: (at drone1 loc11)
   goals met: 7 of 23
29. (deliver-arm1 drone1 person8 crate8 medicine loc11)
   deleted: (arm1-load drone1 crate8) (person-needs person8 medicine)
   added: (arm1-free drone1) (person-has person8 medicine)
   goals met: 8 of 23
30. (move-drone drone1 loc11 depot)
   deleted: (at drone1 loc11)
   added: (at drone1 depot)
   goals met: 9 of 23
31. (grab-arm1 drone1 crate16 depot)
   deleted: (arm1-free drone1) (at crate16 depot)
   added: (arm1-load drone1 crate16)
   goals met: 9 of 23
32. (grab-arm2 drone1 crate18 depot)
   deleted: (arm2-free drone1) (at crate18 depot)
   added: (arm2-load drone1 crate18)
   goals met: 9 of 23
33. (move-drone drone1 depot loc21)
   deleted: (at drone1 depot)
   added: (at drone1 loc21)
   goals met: 8 of 23
34. (deliver-arm1 drone1 person9 crate16 medicine loc21)
   deleted: (arm1-load drone1 crate16) (person-needs person9 medicine)
   added: (arm1-free drone1) (person-has person9 medicine)
   goals met: 9 of 23
35. (move-drone drone1 loc21 loc4)
   deleted: (at drone1 loc21)
   added: (at drone1 loc4)
   goals met: 9 of 23
36. (deliver-arm2 drone1 person10 crate18 medicine loc4)
   deleted: (arm2-load drone1 crate18) (person-needs person10 medicine)
   added: (arm2-free drone1) (person-has person10 medicine)
   goals met: 10 of 23
37. (move-drone drone1 loc4 depot)
   deleted: (at drone1 loc4)
   added: (at drone1 depot)
   goals met: 11 of 23
38. (grab-arm2 drone1 crate5 depot)
   deleted: (arm2-free drone1) (at crate5 depot)
   added: (arm2-load drone1 crate5)
   goals met: 11 of 23
39. (move-drone drone1 depot loc11)
   deleted: (at drone1 depot)
   added: (at drone1 loc11)
   goals met: 10 of 23
40. (deliver-arm2 drone1 person11 crate5 medicine loc11)
   deleted: (arm2-load drone1 crate5) (person-needs person11 medicine)
   added: (arm2-free drone1) (person-has person11 medicine)
   goals met: 11 of 23
41. (move-drone drone1 loc11 depot)
   deleted: (at drone1 loc11)
   added: (at drone1 depot)
   goals met: 12 of 23
42. (grab-arm2 drone1 crate22 depot)
   deleted: (arm2-free drone1) (at crate22 depot)
   added: (arm2-load drone1 crate22)
   goals met: 12 of 23
43. (move-drone drone1 depot loc21)
   deleted: (at drone1 depot)
   added: (at drone1 loc21)
   goals met: 11 of 23
44. (deliver-arm2 drone1 person12 crate22 medicine loc21)
   deleted: (arm2-load drone1 crate22) (person-needs person12 medicine)
   added: (arm2-free drone1) (person-has person12 medicine)
   goals met: 12 of 23
45. (move-drone drone1 loc21 depot)
   deleted: (at drone1 loc21)
   added: (at drone1 depot)
   goals met: 13 of 23
46. (grab-arm2 drone1 crate3 depot)
   deleted: (arm2-free drone1) (at crate3 depot)
   added: (arm2-load drone1 crate3)
   goals met: 13 of 23
47. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 12 of 23
48. (deliver-arm2 drone1 person13 crate3 medicine loc6)
   deleted: (arm2-load drone1 crate3) (person-needs person13 medicine)
   added: (arm2-free drone1) (person-has person13 medicine)
   goals met: 13 of 23
49. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 14 of 23
50. (grab-arm2 drone1 crate12 depot)
   deleted: (arm2-free drone1) (at crate12 depot)
   added: (arm2-load drone1 crate12)
   goals met: 14 of 23
51. (move-drone drone1 depot loc22)
   deleted: (at drone1 depot)
   added: (at drone1 loc22)
   goals met: 13 of 23
52. (deliver-arm2 drone1 person15 crate12 medicine loc22)
   deleted: (arm2-load drone1 crate12) (person-needs person15 medicine)
   added: (arm2-free drone1) (person-has person15 medicine)
   goals met: 14 of 23
53. (move-drone drone1 loc22 depot)
   deleted: (at drone1 loc22)
   added: (at drone1 depot)
   goals met: 15 of 23
54. (grab-arm2 drone1 crate2 depot)
   deleted: (arm2-free drone1) (at crate2 depot)
   added: (arm2-load drone1 crate2)
   goals met: 15 of 23
55. (move-drone drone1 depot loc17)
   deleted: (at drone1 depot)
   added: (at drone1 loc17)
   goals met: 14 of 23
56. (deliver-arm2 drone1 person16 crate2 medicine loc17)
   deleted: (arm2-load drone1 crate2) (person-needs person16 medicine)
   added: (arm2-free drone1) (person-has person16 medicine)
   goals met: 15 of 23
57. (move-drone drone1 loc17 depot)
   deleted: (at drone1 loc17)
   added: (at drone1 depot)
   goals met: 16 of 23
58. (grab-arm2 drone1 crate10 depot)
   deleted: (arm2-free drone1) (at crate10 depot)
   added: (arm2-load drone1 crate10)
   goals met: 16 of 23
59. (grab-arm1 drone1 crate9 depot)
   deleted: (arm1-free drone1) (at crate9 depot)
   added: (arm1-load drone1 crate9)
   goals met: 16 of 23
60. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 15 of 23
61. (deliver-arm1 drone1 person18 crate9 medicine loc8)
   deleted: (arm1-load drone1 crate9) (person-needs person18 medicine)
   added: (arm1-free drone1) (person-has person18 medicine)
   goals met: 16 of 23
62. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 17 of 23
63. (grab-arm1 drone1 crate11 depot)
   deleted: (arm1-free drone1) (at crate11 depot)
   added: (arm1-load drone1 crate11)
   goals met: 17 of 23
64. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 16 of 23
65. (deliver-arm2 drone1 person17 crate10 medicine loc8)
   deleted: (arm2-load drone1 crate10) (person-needs person17 medicine)
   added: (arm2-free drone1) (person-has person17 medicine)
   goals met: 17 of 23
66. (move-drone drone1 loc8 loc20)
   deleted: (at drone1 loc8)
   added: (at drone1 loc20)
   goals met: 17 of 23
67. (move-drone drone1 loc20 loc2)
   deleted: (at drone1 loc20)
   added: (at drone1 loc2)
   goals met: 17 of 23
68. (deliver-arm1 drone1 person1 crate11 medicine loc2)
   deleted: (arm1-load drone1 crate11) (person-needs person1 medicine)
   added: (arm1-free drone1) (person-has person1 medicine)
   goals met: 18 of 23
69. (move-drone drone1 loc2 depot)
   deleted: (at drone1 loc2)
   added: (at drone1 depot)
   goals met: 19 of 23
70. (grab-arm2 drone1 crate21 depot)
   deleted: (arm2-free drone1) (at crate21 depot)
   added: (arm2-load drone1 crate21)
   goals met: 19 of 23
71. (grab-arm1 drone1 crate20 depot)
   deleted: (arm1-free drone1) (at crate20 depot)
   added: (arm1-load drone1 crate20)
   goals met: 19 of 23
72. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 18 of 23
73. (deliver-arm2 drone1 person19 crate21 medicine loc6)
   deleted: (arm2-load drone1 crate21) (person-needs person19 medicine)
   added: (arm2-free drone1) (person-has person19 medicine)
   goals met: 19 of 23
74. (move-drone drone1 loc6 loc9)
   deleted: (at drone1 loc6)
   added: (at drone1 loc9)
   goals met: 19 of 23
75. (deliver-arm1 drone1 person20 crate20 medicine loc9)
   deleted: (arm1-load drone1 crate20) (person-needs person20 medicine)
   added: (arm1-free drone1) (person-has person20 medicine)
   goals met: 20 of 23
76. (move-drone drone1 loc9 depot)
   deleted: (at drone1 loc9)
   added: (at drone1 depot)
   goals met: 21 of 23
77. (grab-arm1 drone1 crate19 depot)
   deleted: (arm1-free drone1) (at crate19 depot)
   added: (arm1-load drone1 crate19)
   goals met: 21 of 23
78. (grab-arm2 drone1 crate4 depot)
   deleted: (arm2-free drone1) (at crate4 depot)
   added: (arm2-load drone1 crate4)
   goals met: 21 of 23
79. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 20 of 23
80. (deliver-arm1 drone1 person21 crate19 medicine loc3)
   deleted: (arm1-load drone1 crate19) (person-needs person21 medicine)
   added: (arm1-free drone1) (person-has person21 medicine)
   goals met: 21 of 23
81. (move-drone drone1 loc3 loc5)
   deleted: (at drone1 loc3)
   added: (at drone1 loc5)
   goals met: 21 of 23
82. (deliver-arm2 drone1 person22 crate4 medicine loc5)
   deleted: (arm2-load drone1 crate4) (person-needs person22 medicine)
   added: (arm2-free drone1) (person-has person22 medicine)
   goals met: 22 of 23
83. (move-drone drone1 loc5 depot)
   deleted: (at drone1 loc5)
   added: (at drone1 depot)
   goals met: 23 of 23
